updates on documentation and readme
